Repository: nawras92/lwn-recipe
Catalog: languages/lwn-recipe-*.po
Languages: ar

source: LWN Recipe
ar: وصفات LWN

source: Manage your recipes easily
ar: إدارة وصفاتك بسهولة

source: Nawras Ali
ar: نورس علي

source: https://learnwithnaw.com
ar: ttps://learnwithnaw.com

source: Settings
ar: الإعدادات

source: LWN Recipe Plugin
ar: إضافة وصفات LWN

source: LWN Recipes
ar: وصفات LWN

source: Lwn Recipe Plugin
ar: إضافة وصفات LWN

source: Manage your recipes smoothly!
ar: إدارة وصفاتك بسهولة

source: How to use?
ar: كيفية الاستخدام

source: Go to the bottom of admin sidebar, choose "Lwn Recipe", and enjoy adding your recipes!
ar: اذهب إلى نهاية الشريط الجانبي للادمن. اختر "وصفات LWN" وثم استمتع بإضافة وصفاتك!

source: How to check all recipes in the frontend?
ar: كيفية عرض كل الوصفات على الواجهة الأمامية؟

source: Go to:
ar: اذهب إلى:

source: All Recipes URL
ar: رابط كل الوصفات

source: Recipe Blocks
ar: مكونات الوصفة

source: You can add customized Gutenberg Recipe Meta Block to the Recipe Post Page!
ar: يمكنك اضافة مكون معلومات الوصفة لصفحة الوصفة.

source: You can add customized Gutenberg Recipe Note Block to the Recipe Post Page!
ar: يمكنك اضافة مكون ملاحظات الوصفة لصفحة الوصفة.

source: Recipe Patterns
ar: أنماط الوصفة

source: You can customized Recipe Patterns; The Recipe steps, The Recipe Ingredients, and The Recipe Short Description
ar: يمكنك تخصيص أنماط الوصفة من نمط خطوات الوصفة، نمط مقادير الوصفة، ونمط الوصف القصير للوصفة.

source: Useful Links
ar: روابط مفيدة

source: If interested, you can learn more about plugin development, and how to make similar plugins here.
ar: إذا كنت مهتماً، يمكنك تعلم المزيد حول تطوير إضافات ووردبريس، وكيفية إنشاء إضافات مماثلة هنا.

source: Check Youtube Videos
ar: شاهد فيديوهات من اليوتيوب

source: Code Repo.
ar: مستودع الكود

source: Preparation Time
ar: مدة التحضير

source: Cooking Time
ar: مدة الطهي

source: Overall Time
ar: المدة الكلية

source: Servings
ar: عدد الأشخاص

source: Meal
ar: الوجبة

source: Vegan?
ar: نباتية؟

source: Yes
ar: نعم

source: No
ar: لا

source: LWN Recipe Short Description
ar: وصف الوصفة القصير

source: Short description about the recipe
ar: وصف قصير عن الوصفة

source: Short Recipe Description....
ar: وصف الوصفة القصير

source: LWN Recipe Ingredients
ar: مقادير الوصفة

source: Recipe Ingredients
ar: مقادير الوصفة

source: Sugar
ar: سكر

source: 1 tablespoon
ar: 1 معلقة كبيرة

source: Flour
ar: دقيق

source: 2 cups
ar: 2 كأس

source: Hot water
ar: ماء ساخن

source: 2 teaspoons
ar: 2 معلقة صغيرة

source: Semolina
ar: سميد

source: 3 cups
ar: 3 كأس

source: LWN Recipe Steps
ar: خطوات الوصفة

source: Recipe Steps
ar: خطوات الوصفة

source: Place water in the container.
ar: ضع الماء في الوعاء

source: Add sugar and semolina.
ar: اضف السكر مع السميد

source: Add flour.
ar: اضف الدقيق.

source: Mix the ingredients together.
ar: اخلط المكونات معاً

source: Recipe Type
ar: نوع الوصفة

source: Add New Recipe Type
ar: إضافة نوع وصفة جديد

source: New Recipe Type Name
ar: إضافة نوع وصفة جديد

source: Add New
ar: إضافة جديد

source: Add New Recipe
ar: إضافة وصفة جديدة

source: Edit
ar: تعديل

source: Edit LWN Recipe
ar: تعديل وصفة LWN

source: View
ar: عرض

source: View LWN Recipe
ar: عرض وصفة LWN

source: Search LWN Recipes
ar: البحث في وصفات LWN

source: No LWN Recipes Found
ar: لم يتم إيجاد وصفات LWN

source: No LWN Recipes Found in Trash
ar: لم يتم إيجاد وصفات LWN في سلة المهملات

source: This block is only available for the recipe post.
ar: هذا المكون متاح فقط لمنشور الوصفات.

source: Breakfast
ar: الفطور

source: Lunch
ar: الغذاء

source: Dinner
ar: العشاء

source: Recipe Settings
ar: إعدادات الوصفة

source: Recipe Time
ar: وقت الوصفة

source: Preparation Time (Minutes)
ar: وقت التحضير (بالدقائق)

source: Cooking Time (Minutes)
ar: مدة الطهي (بالدقائق)

source: Other Recipe Meta
ar: معلومات الوصفة الأخرى

source: Servings (per person)
ar: عدد الأشخاص

source: Is Vegan?
ar: نباتية؟

source: Color Settings
ar: إعدادات اللون

source: Recipe Meta Box Color
ar: لون صندوق معلومات الوصفة

source: Box Background
ar: لون خلفية الصندوق

source: Box Title Color
ar: لون عنوان الصندوق

source: Box Value Color
ar: لون قيمة معلومة الوصفة

source: Recipe Note Text...
ar: نص ملاحظة الوصفة...

# block title
source: Lwn Recipe Meta
ar: مكون معلومات الوصفة

# block description
source: Controls the recipe meta including the preparation time, cook time, overal time, and other
ar: يعرض معلومات الوصفة من مدة التحضير، مدة الطهي والوقت الكلي وغيرها.

# block title
source: Lwn Recipe Notes
ar: مكون ملاحظات الوصفة

# block description
source: Add Note to Recipe Page
ar: اضافة ملاحظة لصفحة الوصفة
